package com.company;

import com.sun.source.util.SourcePositions;

import java.sql.SQLOutput;
import java.util.Scanner;


public class Main {

    public static void main(String[] args) {
 // 1_Dz_exercises_1: В переменную записываем число. Надо вывести на экран сколько в этом
        // числе цифр и положительное оно или отрицательное. Например, "это
        // однозначное положительное число". Достаточно будет определить, является ли
        // число однозначным, "двухзначным или трехзначным и более.

        // int value = 5;
        // if ((value > 0) && (value < 10)) {
        //    String b = "односдначное число";
        //    System.out.println("односдначное число" + value); }
        // if ((value > 10) && (value < 99)) {
        //    String b = "двухсдначное число";
        //    System.out.println("двухсдначное число" + value); }
        // if ((value > 100) && (value < 999)) {
        //    String b = "трехсдначное число";
        //    System.out.println("трехсдначное число" + value); }


 // 1_Dz_exercises_2: Треугольник существует только тогда, когда сумма любых двух его сторон
        // больше третьей. Определить существует ли такой треугольник. Дано: a, b, c –
        // стороны предполагаемого треугольника. Требуется сравнить длину каждого
        // отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок
        // окажется больше суммы двух других, то треугольника с такими сторонами не
        // существует.

        // int a = 5;// сторона треугольника
        // int b = 2;// сторона треугольника
        // int c = 4;// сторона треугольника
        // if ((a + b) > c); {
        //     System.out.println("Треугольника не существует");
        // if ((b + c) > c);{
        //     System.out.println("Треугольника не существует");
        // if ((c + a) > b); {
        //     System.out.println("Треугольника не существует");
        // }
        // }
        // }
        // }
 // }


 // 1_Dz_exercises_3: Дано целое число. Если оно является положительным, то прибавить к нему 1.
        // Если отрицательным, то вычесть из него 2. Если нулевым, то заменить его на
        // 10. Вывести полученное число.)

        // int a = 5;
        // f (a > 0) {
        // a++; }
        // if (a < 0) {
        // a = a - 2; }
        // if (a == 0) {
        // a = 10; }
        //     System.out.println(a);
        // }
        // }


 // 1_Dz_exercises_4: Даны 3 целых числа. Найти количество положительных чисел в исходном наборе.

        //    int a = 6;
        //    int b = -6;
        //    int c = 15;
        //    int d = 1;
        //    if (a > 0) ;
        //    {
        //        d = d + 1;
        //    }
        //    if (b > 0) {
        //        d = d + 1;
        //    }
        //    if (c > 0) {
        //        d = d + 1;
        //    }
        //    System.out.println("положительных чисел:" + d);
        //  }
        //}

 // 1_Dz_exercises_5: Даны 3 целых числа. Найти количество положительных и отрицательных
        // чисел в исходном наборе.

        //    int a = 10;
        //    int b = -10;
        //    int c = 20;
        //    int d = 1;
        //    int e = 1;
        //  if (a > 0) ; {
        //      d = d + 1; }
        //  if (a < 0) {
        //      e = e + 1; }
        //  if (b > 0) {
        //      d = d + 1; }
        //  if (b < 0) {
        //      e = e + 1; }
        //  if (c > 0) {
        //      d = d + 1; }
        //  if (c < 0) {
        //      e = e + 1; }
        //    System.out.println("положительных чисел:" + d);
        //    System.out.println("отрицательных чисел:" + e);
        // }
        //  }

 // 1_Dz_exercises_6: Даны 2 числа. Вывести большее из них.

        // Scanner scanner = new Scanner(System.in);
        // int a = 1;
        // int b = 2;
        // if (a < b) {
        //    System.out.println(b);
        //} else {
        //    System.out.println(a); }


    }
}
